Documents/НормыСписанияГотовойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>НормыСписанияГотовойПродукции</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.НормыСписанияПродукции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГотоваяПродукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НижнийПредел</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВерхнийПредел</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦельСписания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦелиИсследований</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтароеКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовоеКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/НормыСписанияПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>НормыСписанияПродукции</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоСписания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НижнийПредел</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерхнийПредел</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиИсследований</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/НормыСписанияГотовойПродукции/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Функция НоменклатураПриИзмененииНаСервере(ДатаПоказаний, Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НормыСписанияПродукцииСрезПоследних.Продукция КАК Продукция,
		|	НормыСписанияПродукцииСрезПоследних.НижнийПредел КАК НижнийПредел,
		|	НормыСписанияПродукцииСрезПоследних.ВерхнийПредел КАК ВерхнийПредел,
		|	НормыСписанияПродукцииСрезПоследних.ПричинаСписания КАК ПричинаСписания,
		|	НормыСписанияПродукцииСрезПоследних.КоличествоСписания КАК КоличествоСписания
		|ИЗ
		|	РегистрСведений.НормыСписанияПродукции.СрезПоследних(&ДатаПоказаний, ) КАК НормыСписанияПродукцииСрезПоследних
		|ГДЕ
		|	НормыСписанияПродукцииСрезПоследних.КоличествоСписания > 0
		|	И НормыСписанияПродукцииСрезПоследних.Продукция = &Номенклатура";
	
	Запрос.УстановитьПараметр("0", 0);
	Запрос.УстановитьПараметр("ДатаПоказаний", ДатаПоказаний);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	ТаблицаНорм = Новый ТаблицаЗначений;
	ТаблицаНорм = Запрос.Выполнить().Выгрузить();
	ТаблицаНорм.Сортировать("ПричинаСписания");
	
	Возврат ОбщегоНазначенияСервер.ТЗВМассив(ТаблицаНорм);

КонецФункции

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	МассивНорм = Новый Массив;
	МассивНорм = НоменклатураПриИзмененииНаСервере(Объект.Дата, Объект.Номенклатура);
	Для каждого СтрокаМассиваНорм Из МассивНорм Цикл
		СтрокаТаблицыНорм = Объект.ГотоваяПродукция.Добавить();
		СтрокаТаблицыНорм.НижнийПредел = СтрокаМассиваНорм.НижнийПредел;
		СтрокаТаблицыНорм.ВерхнийПредел = СтрокаМассиваНорм.ВерхнийПредел;
		СтрокаТаблицыНорм.ЦельСписания = СтрокаМассиваНорм.ПричинаСписания;
		СтрокаТаблицыНорм.СтароеКоличество = СтрокаМассиваНорм.КоличествоСписания;
		
		
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти
